In [1]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [2]:
df.shape # rows, columns = df.shape

(7, 4)

In [3]:
df.head() # df.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain

In [4]:
df.tail() # df.tail(2)

        day  temperature  windspeed  event
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [5]:
df[1:3]

        day  temperature  windspeed  event
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow

In [6]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [7]:
df['day'] # or df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
6    1/6/2017
Name: day, dtype: object

In [8]:
type(df['day'])

pandas.core.series.Series

In [9]:
df[['day','temperature']]

        day  temperature
0  1/1/2017           32
1  1/2/2017       -99999
2  1/3/2017           28
3  1/4/2017       -99999
4  1/5/2017           32
5  1/6/2017           31
6  1/6/2017           34

In [10]:
df['temperature'].max()

34

In [11]:
df[df['temperature']>32]

        day  temperature  windspeed event
6  1/6/2017           34          5     0

In [12]:
df['day'][df['temperature'] == df['temperature'].max()] # Kinda doing SQL in pandas

6    1/6/2017
Name: day, dtype: object

In [13]:
df[df['temperature'] == df['temperature'].max()] # Kinda doing SQL in pandas

        day  temperature  windspeed event
6  1/6/2017           34          5     0

In [14]:
df['temperature'].std()

48809.83736131575

In [15]:
df['event'].max() # But mean() won't work since data type is string

'Sunny'

In [16]:
df.describe()

        temperature     windspeed
count      7.000000      7.000000
mean  -28548.714286 -28567.285714
std    48809.837361  48797.150657
min   -99999.000000 -99999.000000
25%   -49985.500000 -49998.500000
50%       31.000000      5.000000
75%       32.000000      6.500000
max       34.000000      7.000000

In [17]:
df.set_index('day')

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017       -99999          7  Sunny
1/3/2017           28     -99999   Snow
1/4/2017       -99999          7      0
1/5/2017           32     -99999   Rain
1/6/2017           31          2  Sunny
1/6/2017           34          5      0

In [18]:
df.set_index('day', inplace=True)

In [19]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017       -99999          7  Sunny
1/3/2017           28     -99999   Snow
1/4/2017       -99999          7      0
1/5/2017           32     -99999   Rain
1/6/2017           31          2  Sunny
1/6/2017           34          5      0

In [20]:
df.index

Index(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017',
       '1/6/2017'],
      dtype='object', name='day')

In [21]:
df.loc['1/2/2017']

temperature    -99999
windspeed           7
event           Sunny
Name: 1/2/2017, dtype: object

In [22]:
df.reset_index(inplace=True)
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain

In [23]:
df.set_index('event',inplace=True) # this is kind of building a hash map using event as a key
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017       -99999          7
Snow   1/3/2017           28     -99999
0      1/4/2017       -99999          7
Rain   1/5/2017           32     -99999
Sunny  1/6/2017           31          2
0      1/6/2017           34          5

In [24]:
df.loc['Snow']

day            1/3/2017
temperature          28
windspeed        -99999
Name: Snow, dtype: object